---
kind: property
id: P:Autodesk.Revit.DB.Events.DocumentReloadLatestProgressChangedEventArgs.IsMerging
source: html/d5bf488a-d326-65df-0bf8-a6791c7e37e0.htm
---
# Autodesk.Revit.DB.Events.DocumentReloadLatestProgressChangedEventArgs.IsMerging Property

Indicates if it is merging downloaded data.

## Syntax (C#)
```csharp
public bool IsMerging { get; }
```